In [9]:
import pandas as pd

a = {
    'fstname' : ["Virat", "Kim", "Nick"],
    'lstname' : ["Kohli", "Jo", "Fury"],
    'mobno' : ["1223", "4566", "7890"],
}
df = pd.DataFrame(a)
print(df.shape)
print(df.head(2))
print(df.tail(2))
df

(3, 3)
  fstname lstname mobno
0   Virat   Kohli  1223
1     Kim      Jo  4566
  fstname lstname mobno
1     Kim      Jo  4566
2    Nick    Fury  7890

  fstname lstname mobno
0   Virat   Kohli  1223
1     Kim      Jo  4566
2    Nick    Fury  7890

In [13]:
df1 = {'key': ['K0', 'K1', 'K2', 'K3'],'A': ['A0', 'A1', 'A2', 'A3'], 'B': ['B0', 'B1', 'B2', 'B3']}
df2 = {'key': ['K1', 'K2', 'K3', 'K4'],'A': ['C0', 'C1', 'C2', 'C3'], 'B': ['D0', 'D1', 'D2', 'D3']}

df1 = pd.DataFrame(df1)
df2 = pd.DataFrame(df2)

result_inner = pd.merge(df1, df2, on='key', how='inner')
result_outer = pd.merge(df1, df2, on='key', how='outer')
print(result_inner)
print(result_outer)

employees = {'employee_id': [1, 2, 3, 4],'name': ['Alice', 'Bob', 'Charlie', 'David']}
salaries= {'employee_id': [1, 2, 3, 5],  'salary': [60000, 70000, 80000, 90000]}

df1 = pd.DataFrame(employees)
df2 = pd.DataFrame(salaries)

result_left = pd.merge(df1, df2, on='employee_id', how='left')
result_right = pd.merge(df1, df2, on='employee_id', how='right')
print(result_left)
print(result_right)

  key A_x B_x A_y B_y
0  K1  A1  B1  C0  D0
1  K2  A2  B2  C1  D1
2  K3  A3  B3  C2  D2
  key  A_x  B_x  A_y  B_y
0  K0   A0   B0  NaN  NaN
1  K1   A1   B1   C0   D0
2  K2   A2   B2   C1   D1
3  K3   A3   B3   C2   D2
4  K4  NaN  NaN   C3   D3
   employee_id     name   salary
0            1    Alice  60000.0
1            2      Bob  70000.0
2            3  Charlie  80000.0
3            4    David      NaN
   employee_id     name  salary
0            1    Alice   60000
1            2      Bob   70000
2            3  Charlie   80000
3            5      NaN   90000

In [48]:
a = {
    "Name" : ["John", "Jane", "Bob", "Alice"],
    "Age" : [25, None, 55, 40],
    "Salary" : [25000, 30000, 45000, 30000]
}

df = pd.DataFrame(a)
df = df.fillna(0)
df.Age[(df.Age) > 30] = 100

df.loc[df['Name'] == 'John', 'Age'] = 45
df.loc[df['Name'] == 'John', 'Salary'] = 80000
df

C:\Users\raghv\AppData\Local\Temp\ipykernel_1512\4094273804.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.Age[(df.Age) > 30] = 100

    Name    Age  Salary
0   John   45.0   80000
1   Jane    0.0   30000
2    Bob  100.0   45000
3  Alice  100.0   30000

In [53]:
a = {
    "first_name" : ["John", "Nilly"],
    "last_name" : ["Adam",  "Walker"]
}

df = pd.DataFrame(a)
ndf = pd.DataFrame()
ndf['fullname'] = df['first_name'] + " " + df['last_name']
ndf

       fullname
0     John Adam
1  Nilly Walker

In [112]:
a = {
    "length" : [4,5,6,7,8],
    "width" : [2,3,2.5,4,3.5]
}

df = pd.DataFrame(a)

def area(df):
    a = []
    for i in range(df.shape[0]):
        area = df.loc[i][0] * df.loc[i][1]
        a.append(area)
    return a

df['Area'] = area(df)
df

   length  width  Area
0       4    2.0   8.0
1       5    3.0  15.0
2       6    2.5  15.0
3       7    4.0  28.0
4       8    3.5  28.0

In [79]:
a = {
    "name" : ["John", "Jane", "Bob", "Alice"],
    "Age" : [25, 23, None, 24],
    "Score" : [85, None, 75, 80]
}

df = pd.DataFrame(a)
print(df[df['Age'].isnull()])
print(df[df['Score'].isnull()])
df = df.fillna(df['Age'].mean())
df = df.fillna(df['Score'].mean())
df

  name  Age  Score
2  Bob  NaN   75.0
   name   Age  Score
1  Jane  23.0    NaN

    name   Age  Score
0   John  25.0   85.0
1   Jane  23.0   24.0
2    Bob  24.0   75.0
3  Alice  24.0   80.0

In [90]:
a = {
    "name" : ["John", "Jane", "Bob", "Alice"],
    "Age" : [25, 23, 29, 24],
    "Salary" : [8500, 5500, 7500, 8000]
}

df = pd.DataFrame(a)
df
print(df.loc[1:3, "name" : "Age"])
df.iloc[1:3, 0 : 1]

    name  Age
1   Jane   23
2    Bob   29
3  Alice   24

   name
1  Jane
2   Bob

In [98]:
a = {
    "first_name" : ["John", "Nilly"],
    "last_name" : ["Adam",  "Walker"]
}

df = pd.DataFrame(a)
df.first_name =  df.first_name.str.upper()
df.last_name = df.last_name.str.lower()
df

  first_name last_name
0       JOHN      adam
1      NILLY    walker